#include <linux/io.h>
#include <linux/string.h>
#include <linux/slab.h>
#include <ftl/vfl.h>
#include <ftl/ftl.h>
#include <mach/iphone-clock.h>

#define LOG printk
#define LOGDBG(format, ...)

typedef struct FTLCxtLog {
	u32 usn;					// 0x0
	u16 wVbn;					// 0x4
	u16 wLbn;					// 0x6
	u16* wPageOffsets;				// 0x8
	u16 pagesUsed;				// 0xC
	u16 pagesCurrent;				// 0xE
	u32 isSequential;				// 0x10
} FTLCxtLog;

typedef struct FTLCxtElement2 {
	u16 field_0;				// 0x0
	u16 field_2;				// 0x2
} FTLCxtElement2;

typedef struct FTLCxt {
	u32 usnDec;				// 0x0
	u32 nextblockusn;				// 0x4
	u16 wNumOfFreeVb;				// 0x8
	u16 nextFreeIdx;				// 0xA
	u16 swapCounter;				// 0xC
	u16 awFreeVb[20];				// 0xE
	u16 field_36;				// 0x36
	u32 pages_for_pawMapTable[18];		// 0x38
	u32 pages_for_pawEraseCounterTable[36];	// 0x80
	u32 pages_for_wPageOffsets[34];		// 0x110
	u16* pawMapTable;				// 0x198
	u16* pawEraseCounterTable;			// 0x19C
	u16* wPageOffsets;				// 0x1A0
	FTLCxtLog pLog[18];				// 0x1A4
	u32 eraseCounterPagesDirty;		// 0x30C
	u16 unk3;					// 0x310
	u16 FTLCtrlBlock[3];			// 0x312
	u32 FTLCtrlPage;				// 0x318
	u32 clean;					// 0x31C
	u32 pages_for_pawReadCounterTable[36];	// 0x320
	u16* pawReadCounterTable;			// 0x3B0
	FTLCxtElement2 elements2[5];			// 0x3B4
	u32 field_3C8;				// 0x3C8
	u32 totalReadCount;			// 0x3CC
	u32 page_for_FTLCountsTable;		// 0x3D0
	u32 hasFTLCountsTable;			// 0x3D4, set to -1 if yes
	u8 field_3D8[0x420];			// 0x3D8
	u32 versionLower;				// 0x7F8
	u32 versionUpper;				// 0x7FC
} FTLCxt;

typedef struct FTLCountsTableType {
	u64 totalPagesWritten;		// 0x0
	u64 totalPagesRead;		// 0x8
	u64 totalWrites;			// 0x10
	u64 totalReads;			// 0x18
	u64 compactScatteredCount;		// 0x20
	u64 copyMergeWhileFullCount;	// 0x28
	u64 copyMergeWhileNotFullCount;	// 0x30
	u64 simpleMergeCount;		// 0x38
	u64 blockSwapCount;		// 0x40
	u64 ftlRestoresCount;		// 0x48
	u64 field_50;
} FTLCountsTableType;

typedef enum FTLStruct {
	FTLCountsTableSID = 0x1000200
} FTLStruct;

typedef enum VFLStruct {
	VFLData1SID = 0x2000200,
	VFLData5SID = 0x2000500
} VFLStruct;

#define FTL_ID_V1 0x43303033
#define FTL_ID_V2 0x43303034
#define FTL_ID_V3 0x43303035

// Shared counters

VFLData1Type VFLData1;
static uint8_t VFLData5[0xF8];

#ifdef FTL_PROFILE
u64 TotalWriteTime;
u64 TotalSyncTime;
extern u64 Time_wait_for_ecc_interrupt;
extern u64 Time_wait_for_ready;
extern u64 Time_wait_for_address_done;
extern u64 Time_wait_for_command_done;
extern u64 Time_wait_for_transfer_done;
extern u64 Time_wait_for_nand_bank_ready;
extern u64 Time_nand_write;
extern u64 Time_iphone_dma_finish;
#endif

// Global Buffers

extern NANDData* NANDGeometry;
extern NANDFTLData* FTLData;

static u8* PageBuffer;
static SpareData* FTLSpareBuffer;

static FTLCountsTableType FTLCountsTable;
static FTLCxt* pstFTLCxt;
static FTLCxt* FTLCxtBuffer;
